cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/games'
# tap 'neovim/neovim'

# sigh
cask 'xquartz'
cask 'java'

# essentials
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'elixir'
brew 'gnupg'
brew 'grc'
brew 'mas' # MacOS Amphetamine, Battery Health 2
# brew 'qt' not working with newest macos
brew 'imagemagick'
brew 'jp2a'
brew 'libav'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
# brew 'postgresql'
# brew 'mysql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'httpie'
brew 'nvm'
brew 'midnight-commander'
# brew 'neovim'
brew 'htop'

# developing
# brew 'php71'
# brew 'composer'

# essentials
# cask 'docker'
# tools
cask 'cheatsheet'
cask '1password'
cask 'hyperswitch'
cask 'hyperdock'
cask 'shiftit'
cask 'bartender'
# cask 'trailer' NOT AS USEFUL FOR NOW
# cask 'alfred' let's see how we handle spotlight
# cask 'clipmenu'
# cask 'controlplane' NOT NEEDED NOW
cask 'launchrocket'
# cask 'textexpander'
# cask 'cakebrew' # NOT USED
# cask 'todoist'
cask 'iterm2'
# cask 'keepingyouawake'
cask 'appcleaner'
cask 'dropbox'
cask 'the-unarchiver'
# cask 'fitbit-connect' # NOT USED
cask 'diskwave'
cask 'ccleaner'
cask 'lantern'
# browsers / IDE
# cask 'atom-beta'
cask 'atom'
# cask 'firefox'
cask 'google-chrome'
# cask 'google-chrome-canary'
# cask 'intellij-idea'
# cask 'webstorm'
# cask 'phpstorm'
# cask 'rubymine'
# cask 'macvim'
# work
cask 'slack'
cask 'dash'
cask 'viscosity'
# cask 'adobe-creative-cloud'
# cask 'virtualbox'
# ent
cask 'vlc'
cask 'spotify'
cask 'yacreader'
cask 'spotify'
cask 'gimp'
cask 'inkscape'
cask 'libreoffice'
cask 'xnviewmp'
# cask 'beardedspice'
# cask 'helium' it's not helium browser
# gaming
cask 'steam'
cask 'battle-net'
# other
cask 'handbrake'
cask 'transmission'
# cask 'transmit' NEED TO BUY LICENSE
cask 'tunnelbear'
