cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'homebrew/games'
# tap 'neovim/neovim'
#
# ack			gdbm			httpie			libgcrypt		libxml2			pcre			roundup			watchman
# adns			gettext			icu4c			libgit2			mas			pcre2			ruby-build		wget
# antibody		giflib			imagemagick		libgpg-error		midnight-commander	php71			s-lang			wxmac
# autoconf		git			imlib2			libksba			mysql			php@7.1			screenresolution	x264
# composer		glances			jp2a			libpng			neofetch		pinentry		spaceman-diff		xvid
# coreutils		glib			jpeg			libssh2			nettle			pkg-config		spark			xz
# elixir			gmp			lame			libtasn1		nmap			python			sphinx-doc		yarn
# erlang			gnutls			libassuan		libtiff			npth			python3			sqlite			youtube-dl
# faac			go			libav			libtool			openssl			python@2		stow
# fish			grc			libcaca			libunistring		openssl@1.1		rbenv			unixodbc
# freetype		htop			libffi			libusb			p11-kit			readline		unrar

# sigh
cask 'xquartz'
cask 'java'

# essentials
# brew 'pscp' # ??
brew 'pssh'
brew 'nmap'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'elixir'
brew 'gnupg'
brew 'grc'
brew 'tldr'
brew 'jq'
brew 'pssh'
brew 'mas' # MacOS Amphetamine, Battery Health 2
# brew 'qt' not working with newest macos
brew 'imagemagick'
brew 'jp2a'
brew 'libav'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
# brew 'postgresql'
# brew 'mysql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'httpie'
# brew 'nvm' # zsh-nvm should handle it
brew 'yarn', args: ['without-node']
brew 'midnight-commander'
# brew 'neovim'
brew 'htop'

# developing
# brew 'php71'
# brew 'composer'
#
# adobe-creative-cloud
# filezilla
# firefox
# gimp
# gitee
# github
# gpg-suite
# mpv
# osxfuse
# reactotron
# resilio-sync
# vectr

# essentials
cask 'docker'
# tools
cask 'cheatsheet'
cask '1password'
cask 'hyperswitch'
cask 'hyperdock'
cask 'shiftit'
cask 'bartender'
cask 'veracrypt'
cask 'sequel-pro'
cask 'nordvpn'
cask 'runjs'
cask 'notable'
cask 'graphiql'
# cask 'trailer' NOT AS USEFUL FOR NOW
# cask 'alfred' let's see how we handle spotlight
# cask 'clipmenu'
# cask 'controlplane' NOT NEEDED NOW
cask 'launchrocket'
# cask 'textexpander'
# cask 'cakebrew' # NOT USED
# cask 'todoist'
cask 'iterm2'
# cask 'keepingyouawake'
cask 'appcleaner'
cask 'dropbox'
cask 'kap'
cask 'the-unarchiver'
# cask 'fitbit-connect' # NOT USED
# cask 'diskwave'
# cask 'ccleaner'
cask 'lantern'
# browsers / IDE
# cask 'atom-beta'
# cask 'atom'
cask 'sublime-text'
cask 'visual-studio-code'
# cask 'firefox'
cask 'google-chrome'
# cask 'google-chrome-canary'
# cask 'intellij-idea'
# cask 'webstorm'
# cask 'phpstorm'
# cask 'rubymine'
# cask 'macvim'
# work
cask 'slack'
cask 'dash'
cask 'viscosity'
# cask 'adobe-creative-cloud'
# cask 'virtualbox'
# ent
cask 'iina'
cask 'vlc'
cask 'spotify'
cask 'yacreader'
cask 'spotify'
# cask 'gimp'
# cask 'inkscape'
# cask 'libreoffice'
# cask 'xnviewmp'
# cask 'beardedspice'
# cask 'helium' it's not helium browser
# gaming
# cask 'steam'
# cask 'battle-net'
# other
cask 'handbrake'
cask 'transmission'
# cask 'transmit' NEED TO BUY LICENSE
cask 'tunnelbear'
